_org/s3/bucket.org
#+TITLE: Instance Profile
#+setupfile: ../setup.org

#+begin_src yaml
AWSTemplateFormatVersion: 2010-09-09
Description: A simple S3 bucket
#+end_src

* Parameters

#+name: Params
| Param          | Value |
|----------------+-------|
| DeploymentName | cfc   |

#+begin_src yaml
Parameters:
#+end_src

** DeploymentName

#+begin_src yaml
  DeploymentName:
    Type: String
    Description: A name for this deployment
#+end_src

A *deployment* is a complete deployed application, potentially comprised of many
CloudFormation stacks. This is sometimes called an "environment", but that is an
overloaded term. Use the =DeploymentName= to indicate which deployment a Stack
is part of.

* Resources

#+begin_src yaml
Resources:
#+end_src

** Bucket

#+begin_src yaml
  Bucket:
    Type: AWS::S3::Bucket
    Properties:
      Tags:
        Key: DeploymentName
        Value: !Ref DeploymentName
#+end_src

* Outputs

#+begin_src yaml
Outputs:
  BucketName:
    Description: Name of the created bucket
    Value: !Ref Bucket
#+end_src
